---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDifferenceConfiguration
source: html/77f93e08-edf7-e03b-0671-ca59c6301f32.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceConfiguration

The two assemblies being compared have different spatial configuration

## Syntax (C#)
```csharp
public class AssemblyDifferenceConfiguration : AssemblyDifference
```

## Remarks
Assemblies resulting in this difference might be made up of identical elements,
 but the elements are not arranged in space relative to each other in the same way.